Revit 2024 API
IFCAggregate.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual IEnumerator<IFCData> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of IFCData)
Visual C++
public:
virtual IEnumerator<IFCData^>^ GetEnumerator()
Return Value
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace